schreibfaul1/ESP32-audioI2S/src/Audio.h
/*
 * Audio.h
 *
 */

#pragma once
#pragma GCC optimize("Ofast")
#include "audiolib_structs.hpp"
#include "esp_arduino_version.h"
#include "esp_dsp.h"
#include "psram_unique_ptr.hpp"
#include <Arduino.h>
#include <FFat.h>
#include <FS.h>
#include <NetworkClient.h>
#include <NetworkClientSecure.h>
#include <SD.h>
#include <SD_MMC.h>
#include <WiFi.h>
#include <atomic>
#include <charconv>
#include <codecvt>
#include <deque>
#include <driver/i2s_std.h>
#include <esp32-hal-log.h>
#include <functional>
#include <libb64/cencode.h>
#include <locale>
#include <memory>
#include <optional>
#include <span>
#include <vector>

#ifndef I2S_GPIO_UNUSED
    #define I2S_GPIO_UNUSED -1 // = I2S_PIN_NO_CHANGE in IDF < 5
#endif

extern __attribute__((weak)) void audio_process_raw_samples(int32_t* outBuff, int16_t validSamples);            // before volume, gain and equalizer, record audiodata
extern __attribute__((weak)) void audio_process_i2s(int32_t* outBuff, int16_t validSamples, bool* continueI2S); // after volume, gain and equalizer, send via BT
extern char                       audioI2SVers[];
class Decoder; // prototype

//----------------------------------------------------------------------------------------------------------------------

//  The reserve area contains a copy of the first bytes of the main buffer.
//  Therefore every decoder always receives one contiguous memory block, even if the read position crosses the end of the main buffer.
//
//  Only one memcpy() is required during wrap-around.
//
//  Writer:
//      WiFi / SD
//
//  Reader:
//      Audio decoder
//
//  Reader and writer may work simultaneously.
// ——————————————————————————————————————————————————————————————————————————————

class AudioBuffer {
#define ANSI_ESC_RED   "\033[31m"
#define ANSI_ESC_RESET "\033[0m"
  public:
    // ------------------------------------------------------------
    // Configuration
    // ------------------------------------------------------------

    static constexpr size_t DEFAULT_MAIN_BUFFER_SIZE = UINT16_MAX * 10;
    static constexpr size_t DEFAULT_RESERVE_BUFFER_SIZE = UINT16_MAX;
    // Maximum contiguous block returned by readSpace()/writeSpace().
    // All supported decoders use uint16_t (bytesLeft, bytesAvail, ...). Returning larger blocks has no benefit and would only increase decoder latency.
    static constexpr size_t MAX_TRANSFER_SIZE = UINT16_MAX;

    // ------------------------------------------------------------
    // Construction
    // ------------------------------------------------------------

    AudioBuffer();
    AudioBuffer(size_t mainSize, size_t reserveSize);

    ~AudioBuffer();

    // ------------------------------------------------------------
    // Initialization
    // ------------------------------------------------------------

    size_t init();
    bool   isInitialized() const { return m_initialized; }
    void   reset();

    // ------------------------------------------------------------
    // Configuration
    // ------------------------------------------------------------

    void   setMaxBlocksize(size_t size);
    size_t getMaxBlockSize() const;
    size_t getBufsize() const;

    // ------------------------------------------------------------
    // Buffer information
    // ------------------------------------------------------------

    size_t bufferFilled();
    size_t freeSpace();
    size_t readSpace();
    size_t writeSpace();

    // ------------------------------------------------------------
    // Pointer access
    // ------------------------------------------------------------

    uint8_t* getReadPtr() { return m_readPtr; }   // Pointer remains valid until the next call to bytesWasRead() or reset().
    uint8_t* getWritePtr() { return m_writePtr; } // Pointer remains valid until the next call to bytesWritten() or reset().

    // ------------------------------------------------------------
    // Update pointers
    // ------------------------------------------------------------

    void bytesWritten(size_t bytes);
    void bytesWasRead(size_t bytes);

    // ------------------------------------------------------------
    // Debug
    // ------------------------------------------------------------

    void showStatus();

  protected:
    //-------------------------------------------------------------
    // Buffer configuration
    //-------------------------------------------------------------

    size_t m_mainSize;
    size_t m_reserveSize;
    size_t m_totalSize;
    size_t m_maxBlockSize = 0;
    size_t m_readSpace = 0;
    size_t m_writeSpace = 0;

    //-------------------------------------------------------------
    // Memory
    //-------------------------------------------------------------

    ps_ptr<uint8_t> m_buffer;

    //-------------------------------------------------------------
    // Pointer layout
    //-------------------------------------------------------------

    uint8_t* m_bufferBegin = nullptr;
    uint8_t* m_mainEnd = nullptr;
    uint8_t* m_bufferEnd = nullptr;
    uint8_t* m_readPtr = nullptr;
    uint8_t* m_writePtr = nullptr;

    //-------------------------------------------------------------
    // State
    //-------------------------------------------------------------

    bool m_initialized = false;
    bool m_isEmpty = true;
    bool m_isFull = false;

    //-------------------------------------------------------------
    // Debug
    //-------------------------------------------------------------

    ps_ptr<char> m_log;

    //-------------------------------------------------------------
    // Synchronisation
    //-------------------------------------------------------------

    SemaphoreHandle_t m_mutex = nullptr;

  private:
    //-------------------------------------------------------------
    // Internal helper
    //-------------------------------------------------------------
    void sanityCheck();
};

//----------------------------------------------------------------------------------------------------------------------

class RingBuffer {

