schreibfaul1/ESP32-audioI2S/src/Audio.h
  private:
    // ------- PRIVATE MEMBERS ----------------------------------------

    enum class HeaderResult {
        Continue,
        ContentTypeSeen,
        Redirect,
        Error,
    };

    bool                      i2s_config();
    std::unique_ptr<Decoder>  createDecoder(const std::string& type);
    void                      destroy_decoder();
    void                      latinToUTF8(ps_ptr<char>& buff, bool UTF8check = true);
    void                      htmlToUTF8(char* str);
    void                      setDefaults(); // free buffers and set defaults
    int32_t                   audioFileRead();
    int32_t                   audioFileRead(uint16_t timeout_ms);
    int32_t                   audioFileRead(uint8_t* buff, size_t len);
    int32_t                   audioFileRead(uint8_t* buff, size_t len, uint16_t timeout_ms);
    int32_t                   audioFileSeek(uint32_t position, size_t len = 0);
    void                      initInBuff();
    bool                      httpPrint(const char* host);
    bool                      httpRange(uint32_t range, uint32_t length = UINT32_MAX);
    void                      processLocalFile();
    void                      processWebStream();
    void                      processWebFile();
    void                      processWebStreamTS();
    void                      processWebStreamHLS();
    void                      playAudioData();
    bool                      readPlayListData();
    ps_ptr<char>              parsePlaylist_M3U();
    ps_ptr<char>              parsePlaylist_PLS();
    ps_ptr<char>              parsePlaylist_ASX();
    ps_ptr<char>              parsePlaylist_M3U8();
    uint16_t                  accomplish_m3u8_url();
    int16_t                   prepare_first_m3u8_url(ps_ptr<char>& playlistBuff);
    ps_ptr<char>              m3u8redirection(uint8_t* codec);
    void                      showCodecParams();
    int                       findNextSync(uint8_t* data, size_t len);
    uint32_t                  decodeError(int8_t res, uint8_t* data, int32_t bytesDecoded);
    uint32_t                  decodeContinue(int8_t res, uint8_t* data, int32_t bytesDecoded, int32_t* bytesLeft);
    int                       sendBytes(uint8_t* data, size_t len);
    void                      setDecoderItems();
    uint32_t                  calculate_average_bitrate(uint64_t sum_bytes_in, uint64_t sum_samples);
    void                      calculateAudioTime(uint16_t bytes_decoder_in, uint16_t samples_decoder_out);
    void                      showID3Tag(const char* tag, const char* val);
    size_t                    readAudioHeader(uint32_t bytes);
    int                       read_WAV_Header(uint8_t* data, size_t len);
    int                       read_FLAC_Header(uint8_t* data, size_t len);
    int                       read_ID3_Header(uint8_t* data, size_t len);
    int                       read_M4A_Header(uint8_t* data, size_t len);
    size_t                    process_m3u8_ID3_Header(uint8_t* packet);
    bool                      setSampleRate(uint32_t hz);
    bool                      setBitsPerSample(int bits);
    bool                      setChannels(int channels);
    uint32_t                  resampleI2Soutput(audiolib::resampler_t& resampler, int32_t* input, uint32_t inputSamples, int32_t* output);
    void                      cacheSamples();
    void                      playChunk();
    void                      calculateVUlevel(int32_t* buff, size_t len);
    void                      calculateSpectrum(int32_t* buff, size_t len);
    void                      Gain(int32_t* buff, size_t len);
    void                      stereo2mono(int32_t* buff, size_t len);
    void                      IIR_filter(int32_t* buff, size_t len);
    void                      gain_ramp();
    void                      calculateVolumeLimits();
    void                      showstreamtitle(char* ml);
    bool                      parseContentType(ps_ptr<char> ct);
    std::vector<ps_ptr<char>> readHeader();
    HeaderResult              parseHeaderLine(ps_ptr<char> name, ps_ptr<char> value, ps_ptr<char>& redirectUrl);
    bool                      parseHttpResponseHeader();
    bool                      parseHttpRangeHeader();
    bool                      initializeDecoder();
    esp_err_t                 I2Sstart();
    esp_err_t                 I2Sstop();
    void                      zeroI2Sbuff();
    void                      reconfigI2S();
    void                      IIR_calculateCoefficients();
    uint32_t                  streamavail() { return m_client ? m_client->available() : 0; }
    bool                      ts_parsePacket(uint8_t* packet, uint8_t* packetStart, uint8_t* packetLength);
    uint64_t                  getLastGranulePosition(uint8_t codec);

    //+++ create a T A S K  for playAudioData(), output via I2S +++
  public:
    void     setAudioTaskCore(uint8_t coreID);
    uint32_t getHighWatermark();

  private:
    void        startAudioTask(); // starts a task for decode and play
    void        stopAudioTask();  // stops task for audio
    static void audioTaskWrapper(void* param);
    void        audioTask();
    void        performAudioTask();

    //+++ H E L P   F U N C T I O N S +++
    bool                   readMetadata(uint32_t b, uint16_t* readedBytes, bool first = false);
    int32_t                getChunkSize(uint16_t* readedBytes, bool first = false);
    bool                   readID3V1Tag();
    int32_t                newInBuffStart(int32_t resumeFilePos);
    boolean                streamDetection(uint32_t bytesAvail);
    uint32_t               m4a_correctResumeFilePos();
    int32_t                ogg_correctResumeFilePos();
    int32_t                flac_correctResumeFilePos();
    int32_t                mp3_correctResumeFilePos();
    int32_t                wav_correctResumeFilePos();
    uint8_t                determineCodec(uint8_t presumed_codec);
    bool                   get_info();
    void                   trim(char* str);
    bool                   startsWith(const char* base, const char* str);
    int                    indexOf(const char* base, const char* str, int startIndex = 0);
    int                    indexOf(const char* base, char ch, int startIndex = 0);
    int                    specialIndexOf(uint8_t* base, const char* str, int baselen, bool exact = false);
    int32_t                min3(int32_t a, int32_t b, int32_t c);
    uint64_t               bigEndian(uint8_t* base, uint8_t numBytes, uint8_t shiftLeft = 8);
    bool                   b64encode(const char* source, uint16_t sourceLength, char* dest);
    uint32_t               simpleHash(const char* str);
    ps_ptr<char>           urlencode(const char* str, bool spacesOnly);
    audiolib::BiquadCoeffs makeButterworthLPF_Q31(float fs);

