schreibfaul1/ESP32-audioI2S/src/Audio.h
  private:
    enum : int { APLL_AUTO = -1, APLL_ENABLE = 1, APLL_DISABLE = 0 };
    enum : int { EXTERNAL_I2S = 0, INTERNAL_DAC = 1, INTERNAL_PDM = 2 };
    enum : int { FORMAT_NONE = 0, FORMAT_M3U = 1, FORMAT_PLS = 2, FORMAT_ASX = 3, FORMAT_M3U8 = 4 }; // playlist formats
    const char* plsFmtStr[5] = {"NONE", "M3U", "PLS", "ASX", "M3U8"};                                // playlist format string
    enum : int { AUDIO_NONE, HTTP_RESPONSE_HEADER, HTTP_RANGE_HEADER, AUDIO_DATA, AUDIO_LOCALFILE, AUDIO_PLAYLISTINIT, AUDIO_PLAYLISTHEADER, AUDIO_PLAYLISTDATA };
    const char* dataModeStr[8] = {"AUDIO_NONE", "HTTP_RESPONSE_HEADER", "HTTP_RANGE_HEADER", "AUDIO_DATA", "AUDIO_LOCALFILE", "AUDIO_PLAYLISTINIT", "AUDIO_PLAYLISTHEADER", "AUDIO_PLAYLISTDATA"};
    enum : int { FLAC_BEGIN = 0, FLAC_MAGIC = 1, FLAC_MBH = 2, FLAC_SINFO = 3, FLAC_PADDING = 4, FLAC_APP = 5, FLAC_SEEK = 6, FLAC_VORBIS = 7, FLAC_CUESHEET = 8, FLAC_PICTURE = 9, FLAC_OKAY = 100 };
    enum : int { MP3_BEGIN = 0, MP3_ID3HEADER, MP3_NEXTID3, MP3_EXTHEADER, MP3_ID3FRAME, MP3_FRAMESIZE, MP3_SKIP, MP3_TAG, MP3_SYLT, MP3_ID3V22, MP3_LASTFRAMES, MP3_XING, MP3_OKAY = 100 };
    enum : int {
        M4A_BEGIN = 0,
        M4A_FTYP = 1,
        M4A_CHK = 2,
        M4A_MOOV = 3,
        M4A_FREE = 4,
        M4A_TRAK = 5,
        M4A_MDAT = 6,
        M4A_ILST = 7,
        M4A_MP4A = 8,
        M4A_ESDS = 9,
        M4A_MDIA = 10,
        M4A_MINF = 11,
        M4A_STBL = 12,
        M4A_STSD = 13,
        M4A_UDTA = 14,
        M4A_STSZ = 15,
        M4A_META = 16,
        M4A_MDHD = 17,
        M4A_CHPL = 18,
        M4A_AMRDY = 99,
        M4A_OKAY = 100,
    };
    enum : int { CODEC_NONE = 0, CODEC_WAV = 1, CODEC_MP3 = 2, CODEC_AAC = 3, CODEC_M4A = 4, CODEC_FLAC = 5, CODEC_OPUS = 6, CODEC_VORBIS = 7, CODEC_OGG = 8 };
    const char* codecname[10] = {"unknown", "WAV", "MP3", "AAC", "M4A", "FLAC", "OPUS", "VORBIS", "OGG"};
    const float est_compression[10] = {1.0f, 1.0f, 11.0f, 9.0f, 9.0f, 2.0f, 12.0f, 8.0f, 1.0f};
    enum : int { ST_NONE = 0, ST_WEBFILE = 1, ST_WEBSTREAM = 2 };
    const char* streamTypeStr[3] = {"NONE", "WEBFILE", "WEBSTREAM"};
    typedef enum { LEFTCHANNEL = 0, RIGHTCHANNEL = 1 } SampleIndex;
    typedef enum { LOWSHELF = 0, PEAKINGEQ = 1, HIFGSHELF = 2 } FilterType;

  private:
    typedef struct _filter {
        float a0;
        float a1;
        float a2;
        float b1;
        float b2;
    } filter_t;

    typedef struct _pis_array {
        int number;
        int pids[4];
    } pid_array;

  public:
    struct audioSettings {
        uint16_t DMA_DESC_NUM = 16;                // i2s - dma;  number of I2S DMA buffer
        uint16_t DMA_FRAME_NUM = 256;              // i2s - dma;  number of frames in one DMA buffer
        uint16_t FREQ_LS_HZ = 500;                 // IIR Filter: lowshelf
        uint16_t FREQ_PEAK_HZ = 1800;              // IIR Filter: peakingEQ
        uint16_t FREQ_HS_HZ = 6000;                // IIR Filter: highshelf
        float    QUALITY_SLOPE = 0.707;            // IIR Filter: quality (all shelfes)
        bool     IIR_FILTER = true;                // IIR Filter: true -> IIR filter (highshelf, bandpass, lowshelf) are enabled
        uint8_t  VU_BARS_ATTACK_STEP = 200;        // vu-meter:   bars rising steps
        uint8_t  VU_BARS_RELEASE_STEP = 30;        // vu-meter:   bars falling steps
        uint8_t  VU_BARS_HOLD_CYCLES = 1;          // vu-meter:   bars hold_cycles
        uint8_t  VU_PEAK_ATTACK_STEP = 200;        // vu-meter:   peak rising steps
        uint8_t  VU_PEAK_RELEASE_STEP = 10;        // vu-meter:   peak falling steps
        uint8_t  VU_PEAK_HOLD_CYCLES = 2;          // vu-meter:   peak hold_cycles
        bool     VU_LEVEL = false;                 // vu-meter:   true -> vu meter is enabled
        uint8_t  SP_BARS_ATTACK_STEP = 100;        // spectrum:   bars rising steps
        uint8_t  SP_BARS_RELEASE_STEP = 20;        // spectrum:   bars falling steps
        uint8_t  SP_BARS_HOLD_CYCLES = 1;          // spectrum:   bars hold_cycles
        uint8_t  SP_PEAK_ATTACK_STEP = 200;        // spectrum:   peak rising steps
        uint8_t  SP_PEAK_RELEASE_STEP = 10;        // spectrum:   peak falling steps
        uint8_t  SP_PEAK_HOLD_CYCLES = 2;          // spectrum:   peak hold_cycles
        bool     SPECTRUM = false;                 // true: spectrum analyzer is enabled
        bool     VOLUME_CONTROL = true;            // true: volume and balance control is enabled
        float    VOL_FADING_SPEED = 50.0;          // mute, volume fading 1.0f (fast) ... 100.0f (slow)
        uint32_t BUFFER_TRESHOLD_HLS = UINT16_MAX; // Level at which the HLS-TS stream starts and is reloaded
    } settings;

    std::atomic<uint32_t> m_dmaFreeDesc = 0;

  private:
    File                m_audiofile;
    NetworkClient       client;
    NetworkClientSecure clientsecure;
    NetworkClient*      m_client = nullptr;

    SemaphoreHandle_t mutex_audioTask;
    SemaphoreHandle_t mutex_audioTaskIsDecoding;
    TaskHandle_t      m_audioTaskHandle = nullptr;

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wmissing-field-initializers"

    i2s_chan_handle_t m_i2s_tx_handle = {};
    i2s_chan_config_t m_i2s_chan_cfg = {}; // stores I2S channel values
    i2s_std_config_t  m_i2s_std_cfg = {};  // stores I2S driver values

#pragma GCC diagnostic pop

    std::vector<ps_ptr<char>> m_playlistContent; // m3u8 playlist buffer from responseHeader
    std::vector<ps_ptr<char>> m_playlistURL;     // m3u8 streamURLs buffer
    std::deque<ps_ptr<char>>  m_linesWithURL;    // extract from m_playlistContent, contains URL and MediaSequenceNumber
    std::vector<ps_ptr<char>> m_linesWithEXTINF; // extract from m_playlistContent, contains length and metadata
    std::vector<ps_ptr<char>> m_syltLines;       // SYLT line table
    std::vector<uint32_t>     m_syltTimeStamp;   // SYLT time table

    static const uint8_t m_tsPacketSize = 188;
    static const uint8_t m_tsHeaderSize = 4;

    std::unique_ptr<Decoder> m_decoder = {};
    ps_ptr<int32_t>          m_outBuff;         // Interleaved L/R
    ps_ptr<int32_t>          m_resamplesBuff;   // Interleaved L/R
    ps_ptr<int32_t>          m_i2sWorkBuff;     // between SamülesBuff and i2s_channel_write()
    ps_ptr<char>             m_metadataBuff;    // icy-metadata max (16 * 256 + 1) bytes
    ps_ptr<char>             m_httpRespHdrBuff; // store http response header
    ps_ptr<char>             m_ibuff;           // used in log_info()
    ps_ptr<char>             m_lastHost;        // Store the last URL to a webstream
    ps_ptr<char>             m_currentHost;     // can be changed by redirection or playlist
    ps_ptr<char>             m_m3u8_host;
    ps_ptr<char>             m_speechtxt;   // stores tts text
    ps_ptr<char>             m_streamTitle; // stores the last StreamTitle
    ps_ptr<char>             m_streamURL;   // stores the last StreamURL
    ps_ptr<char>             m_playlistBuff;
    VolumeCurveFn            m_volumeCurve = nullptr;

