schreibfaul1/ESP32-audioI2S/src/Audio.h
    const uint16_t m_plsBuffEntryLen = 256;        // length of each entry in playlistBuff
    int            m_LFcount = 0;                  // Detection of end of header
    uint32_t       m_audioFilePosition = 0;        // current position, counts every readed byte
    uint32_t       m_audioDataReadPtr = 0;         // used in playAudioData
    uint32_t       m_audioFileSize = 0;            // local and web files
    int            m_readbytes = 0;                // bytes read
    uint32_t       m_metacount = 0;                // counts down bytes between metadata
    int            m_controlCounter = 0;           // Status within readID3data() and readWaveHeader()
    uint8_t        m_timeoutCounter = 0;           // timeout counter
    uint8_t        m_bitsPerSample = 16;           // bitsPerSample
    uint8_t        m_channels = 2;                 //
    uint8_t        m_playlistFormat = 0;           // M3U, PLS, ASX
    uint8_t        m_codec = CODEC_NONE;           //
    uint8_t        m_m3u8Codec = CODEC_AAC;        // codec of m3u8 stream
    uint8_t        m_expectedCodec = CODEC_NONE;   // set in connecttohost (e.g. http://url.mp3 -> CODEC_MP3)
    uint8_t        m_expectedPlsFmt = FORMAT_NONE; // set in connecttohost (e.g. streaming01.m3u) -> FORMAT_M3U)
    uint8_t        m_streamType = ST_NONE;         //
    uint8_t        m_ID3Size = 0;                  // lengt of ID3frame - ID3header
    uint8_t        m_audioTaskCoreId = 0;          //
    uint8_t        m_M4A_objectType = 0;           // set in read_M4A_Header
    uint8_t        m_M4A_chConfig = 0;             // set in read_M4A_Header
    uint16_t       m_M4A_sampleRate = 0;           // set in read_M4A_Header
    int16_t        m_validSamples = 0;             //
    int16_t        m_curSample = 0;                //
    uint16_t       m_dataMode = 0;                 // Statemaschine
    uint16_t       m_streamTitleHash = 0;          // remember streamtitle, ignore multiple occurence in metadata
    uint16_t       m_timeout_ms = 250;             //
    uint16_t       m_timeout_ms_ssl = 2700;        //
    uint32_t       m_metaint = 0;                  // Number of databytes between metadata
    uint32_t       m_chunkcount = 0;               // Counter for chunked transfer
    uint32_t       m_t0 = 0;                       // store millis(), is needed for a small delay
    uint32_t       m_bytesNotConsumed = 0;         // pictures or something else that comes with the stream
    uint64_t       m_lastGranulePosition = 0;      // necessary to calculate the duration in OPUS and VORBIS

    uint32_t m_nominal_bitrate = 0;       // given br from header
    uint32_t m_avr_bitrate = 0;           // average bitrate, median calculated by VBR
    uint32_t m_total_samples_in_file = 0; // given or calculated from header
    uint32_t m_avr_samples_in_file = 0;   // average total samples in file, estimated
    uint32_t m_audio_file_duration = 0;   // seconds
    uint32_t m_avr_file_duration = 0;     // average duration in seconds, estimated
    uint32_t m_samples_since_start = 0;   //

    int32_t    m_resumeFilePos = -1;              // the return value from stopSong(), (-1) is idle
    int32_t    m_fileStartTime = -1;              // may be set in connecttoFS()
    uint16_t   m_m3u8_targetDuration = 10;        //
    uint32_t   m_stsz_numEntries = 0;             // num of entries inside stsz atom (uint32_t)
    uint32_t   m_stsz_position = 0;               // pos of stsz atom within file

    bool       m_f_haveNewFilePos = false;        // user changed the file position
    bool       m_f_I2S_init = false;              //
    bool       m_f_unsync = false;                // set within ID3 tag but not used
    bool       m_f_exthdr = false;                // ID3 extended header
    bool       m_f_ssl = false;                   //
    bool       m_f_running = false;               //
    bool       m_f_firstCall = false;             // InitSequence for processWebstream and processLokalFile
    bool       m_f_firstLoop = false;             // InitSequence in loop()
    bool       m_f_firstPlayCall = false;         // InitSequence for playAudioData
    bool       m_f_firstCacheSamplesCall = false; // InitSequence for cacheSamples
    bool       m_f_first_vu_call = false;         // InitSequence for calculateVUlevel
    bool       m_f_firstChunkCall = false;        // InitSequence for playChunk
    bool       m_f_first_fft_call = false;        // InitSequence for calculateSpectrum
    bool       m_f_ID3v1TagFound = false;         // ID3v1 tag found
    bool       m_f_chunked = false;               // Station provides chunked transfer
    bool       m_f_firstmetabyte = false;         // True if first metabyte (counter)
    bool       m_f_playing = false;               // valid mp3 stream recognized
    bool       m_f_tts = false;                   // text to speech
    bool       m_f_ogg = false;                   // OGG stream
    bool       m_f_forceMono = false;             // if true stereo -> mono
    bool       m_f_rtsp = false;                  // set if RTSP is used (m3u8 stream)
    bool       m_f_m3u8data = false;              // used in processM3U8entries
    bool       m_f_continue = false;              // next m3u8 chunk is available
    bool       m_f_ts = true;                     // transport stream
    bool       m_f_m4aID3dataAreRead = false;     // has the m4a-ID3data already been read?
    bool       m_f_psramFound = false;            // set in constructor, result of psramInit()
    bool       m_f_timeout = false;               //
    bool       m_f_audioTaskIsRunning = false;    //
    bool       m_f_allDataReceived = false;       //
    bool       m_f_stream = false;                // stream ready for output?
    bool       m_f_decode_ready = false;          // if true data for decode are ready
    bool       m_f_eof = false;                   // end of file
    bool       m_f_lockInBuffer = false;          // lock inBuffer for manipulation
    bool       m_f_audioTaskIsDecoding = false;   //
    bool       m_f_acceptRanges = false;          //
    bool       m_f_reset_m3u8Codec = true;        // reset codec for m3u8 stream
    bool       m_f_connectionClose = false;       // set in parseHttpResponseHeader
    bool       m_f_i2s_channel_enabled = false;   // true if enabled
    bool       m_f_mute = false;
    uint32_t   m_audioCurrentTime = 0;  // seconds
    uint32_t   m_audioDataStart = 0;    // in bytes
    OutputSR_t m_output_sr = SR_ORIGIN; // output samplerate
    size_t     m_audioDataSize = 0;     //
    size_t     m_ibuffSize = 0;         // log buffer size for audio_info()
    size_t     m_i2s_bytesWritten = 0;  // set in i2s_write() but not used
    size_t     m_work_words = 0;        // calculated in setPinout()

    pid_array m_pidsOfPMT;
    int16_t   m_pidOfAAC;
    uint8_t   m_packetBuff[m_tsPacketSize];
    int16_t   m_pesDataLength = 0;

    // audiolib structs
    audiolib::ID3Hdr_t     m_ID3Hdr;
    audiolib::pwsHLS_t     m_pwsHLS;
    audiolib::pplM3u8_t    m_pplM3U8;
    audiolib::m4aHdr_t     m_m4aHdr;
    audiolib::plCh_t       m_plCh;
    audiolib::caSa_t       m_caSa;
    audiolib::lVar_t       m_lVar;
    audiolib::prlf_t       m_prlf;
    audiolib::cab_t        m_cab;
    audiolib::cat_t        m_cat;
    audiolib::ifCh_t       m_ifCh;
    audiolib::tspp_t       m_tspp;
    audiolib::pwst_t       m_pwst;
    audiolib::gchs_t       m_gchs;
    audiolib::pwf_t        m_pwf;
    audiolib::pad_t        m_pad;
    audiolib::sbyt_t       m_sbyt;
    audiolib::rmet_t       m_rmet;
    audiolib::pwsts_t      m_pwsst;
    audiolib::rwh_t        m_rwh;
    audiolib::rflh_t       m_rflh;
    audiolib::phreh_t      m_phreh;
    audiolib::phrah_t      m_phrah;
    audiolib::sdet_t       m_sdet;
    audiolib::fnsy_t       m_fnsy;
    audiolib::audioItems_t m_audio_items;
    audiolib::vu_items_t   m_vu_items;
    audiolib::fft_items_t  m_fft_items;
    audiolib::i2s_items_t  m_i2s_items;
    audiolib::resampler_t  m_resampler;

    struct info_queue_t {
        std::deque<audiolib::InfoItem> queue;
        void                           reset() { queue.clear(); }
    } m_info_queue;

    inline uint8_t sampleToVU(int32_t sample) {
        uint32_t mag;
        if (sample < 0)
            mag = (uint32_t)(-(int64_t)sample);
        else
            mag = (uint32_t)sample;
        return std::min<uint32_t>(mag >> 23, 255);
    }

    inline bool isFile() {
        if (m_dataMode == AUDIO_LOCALFILE) return true;
        if (m_streamType == ST_WEBFILE && m_playlistFormat != FORMAT_M3U8) return true;
        return false;
    }

    inline bool isStream() {
        if (m_streamType == ST_WEBSTREAM || m_playlistFormat == FORMAT_M3U8) return true;
        return false;
    }

    // —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
  private:
    static int32_t extract_last_number(std::string_view s) {
        auto is_space = [](char c) { return std::isspace(static_cast<unsigned char>(c)); };
        auto is_digit = [](char c) { return std::isdigit(static_cast<unsigned char>(c)); };
        auto it = s.end();
        // skip trailing whitespace
        while (it != s.begin() && is_space(*(it - 1))) { --it; }
        auto end = it;
        // Reading numbers backwards
        while (it != s.begin() && is_digit(*(it - 1))) { --it; }
        // optional sign
        if (it != s.begin()) {
            char c = *(it - 1);
            if (c == '+' || c == '-') { --it; }
        }
        // found nothing?
        if (it == end) { return 0; }
        // There must be a leading space or a space before the number
        if (it != s.begin() && !is_space(*(it - 1))) { return 0; }
        int32_t value{};
        auto [ptr, ec] = std::from_chars(it, end, value);
        // Was the full parse successful?
        if (ec == std::errc{} && ptr == end) { return value; }
        return 0;
    }

    static bool enqueueInfo(Audio& instance, event_t e, ps_ptr<char>&& msg, int32_t arg1 = 0, int32_t arg2 = 0, std::vector<uint32_t>&& vec1 = {}, std::vector<uint32_t>&& vec2 = {}) {

        std::lock_guard<std::mutex> lock(instance.mutex_info);
        if (!audio_info_callback) return false;
        if (instance.m_info_queue.queue.size() >= 1000) {
            log_e("infoqueue is full");
            return false;
        }
        audiolib::InfoItem item;
        item.s = eventStr[e];
        item.e = static_cast<uint8_t>(e);
        item.msg = std::move(msg);
        item.arg1 = arg1;
        item.arg2 = arg2;
        item.vec1 = std::move(vec1);
        item.vec2 = std::move(vec2);

        instance.m_info_queue.queue.push_back(std::move(item));
        return true;
    }

